<?php
/* Задача 16:
Да се състави програма, чрез която предварително въведени 10
реални числа от интервала се обработват по следния начин:
1. Извежда съществуващите числа.
2. Всички елементи със стойност по-малки от -0.231 се заменят със
сумата от квадрата на индекса им + числото 41.25, а всички останали
елементи се заменят с произведението между самия елемент и
неговият пореден номер
3. Да се изведат елементите от началния и новообразувания масив.
4. Да се изведат средната стойност на всички елементи от новата
редица, които са различни от 0.
Пример: -1.12, -2.43, 3.1, 4.2, 0, 6.4, - 7.5, 8.6, 9.1, -4
Изход: 42.25, 45.25, 9.3, 16.8, 0, 38.4, 90.25, 68.8, 81.9,141.25 
//Примерният изход не е този, който се описва в условието*/

require_once 'NonNativeFunctons.php';

$realNumbers = [-1.12, -2.43, 3.1, 4.2, 0, 6.4, - 7.5, 8.6, 9.1, -4];

$modifiedArray = [];

foreach ($realNumbers as $key => $value) {
	if ($value < -0.231) {
		$modifiedArray[] = pow($key, 2) + 41.25;
	} else {
		$modifiedArray[] = $value * ($key + 1);
	}
}

echo implode(', ', $realNumbers) . PHP_EOL;
echo implode(', ', $modifiedArray) . PHP_EOL;

$average = array_sum($modifiedArray) / 
	(count($modifiedArray) - array_count_values_of(0, $modifiedArray));

echo $average;
